#include "Tapdev.h"
#include "uip.h"

//用于固定IP地址开关打开后的IP设置，本例程没有用这个
#define UIP_DRIPADDR0   192
#define UIP_DRIPADDR1   168
#define UIP_DRIPADDR2   0
#define UIP_DRIPADDR3   15
extern void etherdev_init(void);
/*---------------------------------------------------------------------------*/
/* 配置网卡硬件，设置IP地址 */
void tapdev_init(void)
{
  etherdev_init();
}

/****************************************************************************
* 名    称：uint16_t tapdev_read(void)
* 功    能：																		 
* 入口参数：读取一包数据
* 出口参数: 如果一个数据包收到返回数据包长度，以字节为单位，否则为零。
* 说    明：
* 调用方法：
****************************************************************************/ 
uint16_t tapdev_read(void)
{	
  return  enc28j60PacketReceive(1500,uip_buf);
}
/****************************************************************************
* 名    称：void tapdev_send(void)
* 功    能：																		 
* 入口参数：发送一包数据
* 出口参数: 
* 说    明：
* 调用方法：
****************************************************************************/ 
void tapdev_send(void)
{
  enc28j60PacketSend(uip_len,uip_buf);
}

/*---------------------------------------------------------------------------*/
